Repository: Mrbahi98/PixStore
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: About & FAQ
ar: الأسئلة الشائعة

source: About PixStore
ar: حول بيكس ستور

source: PixStore is a digital marketplace providing premium templates, tools, and creative assets for developers and designers.
ar: بيكس ستور هو موقع يقدم عديد المنتجات الرقمية خاصة الحزم الشاملة التي تساعد ويحتاجها اي شخص لبدأ مشروعه الخاص

source: Our mission is to help creators work faster, smarter, and with confidence using carefully curated digital products.
ar: مهمتنا الرئيسية و الدائمة هي مساعدة صناع المحتوى الجدد و المبتدئين لبدأ رحلتهم في عالم المنتجات الرقمية بشكل اسرع و اسهل من خلال تقديم كل الادوات التي يحتاجونها

source: What does PixStore sell?
ar: ماذا يبيع بيكس ستور

source: PixStore sells digital products such as templates, UI kits, tools, and design assets ready for instant use.
ar: يبيع بيكس ستور منتجات رقمية عبارة حزم شاملة لعديد المنتجات و الادوات الرقمية التي يحتاجها اي صانع محتوى جديد او مبتدئ

source: How do I receive my purchase?
ar: كيف استلم مشترياتي؟

source: After completing payment, you will receive instructions to access your purchased digital product.
ar: بعد اكمال عملية الدفع و ارسال الاثبات سوف تصلك رسالة في البريد الالكتروني توضح تفاصيل وحالة الطلب الخاص بك و يمكنك تتبع حالته مباشرة و في أي وقت و بعد التأكد من الدفع عن طريق فريقنا سوف تستلم منتجك مباشرة في بريك الالكتروني نفسه

source: Can I get a refund?
ar: هل من الممكن اعادة أموالي؟

source: Due to the nature of digital products, refunds are handled on a case-by-case basis. Please contact support if needed.
ar: على حسب طبيعة المنتج الرقمي فيتم دراسة عمليات الاسترداد بشكل دقيق بين اعضاء الفريق و على الزبون ان يوضح سبب الاسترداد بدقة عن طريق ارسال رسالة للدعم التقني للموقع

source: Home
ar: الصفحة الرئيسية

source: Products
ar: المنتجات

source: My Orders
ar: طلباتي

source: Remove
ar: ازالة

source: All Rights Reserved
ar: كل الحقوق محفوظة

source: Product added successfully!
ar: تم اضافة المنتج بنجاح

source: Order Successful | PixStore
ar: تم الطلب بنجاح

source: Payment Successful!
ar: تم الدفع بنجاح

source: Your digital products are ready. You’ll receive access details by email shortly.
ar: منتجك الرقمي جاهز, سوف تستلمه في بريدك الالكتروني

source: Continue Shopping
ar: متابعة التسوق

source: View My Orders
ar: اظهار طلباتي

source: All Rights Reserved.
ar: كل الحقوق محفوظة

source: Checkout Summary
ar: ملخص الدفع

source: Full Name
ar: الاسم الكامل

source: Email
ar: البريد الالكتروني

source: Select Payment Method
ar: اختار وسيلة دفع

source: Crypto
ar: كريبتو

source: Baridimob
ar: بريدي موب

source: Items
ar: اغراض

source: Continue to Proof Upload
ar: المتابعة لاثبات الدفع

source: Cancel Order
ar: الغاء الطلب

source: Contact PixStore
ar: تواصل مع بيكس ستور

source: Have questions or feedback? We’d love to hear from you
ar: هل لديك أسئلة أو رأي؟ نحن في الاستماع

source: Your Email
ar: بريدك الالكتروني

source: Message
ar: الرسالة

source: Send Message
ar: ارسال

source: Other Ways to Reach Us
ar: طرق أخرى للتواصل معنا

source: Launch Your First Digital Product — Without Confusion, Tech Stress, or Wasted Time
ar: أطلق منتجك الرقمي الأول — وداعاً للحيرة، تعقيدات التقنية، والوقت الضائع

source: PixStore helps beginners and content creators build their first digital product using clear systems, ready-to-use tools, and a step-by-step launch path — not random files.
ar: .يساعد بيكس ستور المبتدئين وصنّاع المحتوى على بناء أول منتج رقمي لهم عبر أنظمة واضحة، وأدوات جاهزة للاستخدام، ومسار إطلاق تدريجي — نحن لا نمنحك مجرد ملفات عشوائية

source: Explore Products
ar: استكشف المنتجات

source: Featured Products
ar: المنتجات المميزة

source: View Details
ar: التفاصيل

source: No products available yet.
ar: لا توجد منتجات متاحة حاليا

source: Quick Links
ar: روابط سريعة

source: About
ar: حول

source: Contact Us
ar: تواصل معنا

source: Back to Store
ar: العودة للمتجر

source: Buy Now
ar: الشراء الأن

source: All Products
ar: جميع المنتجات

source: All Categories
ar: جميع الفئات

source: Upload Payment Proof
ar: رفع اثبات الدفع

source: Available Accounts
ar: الحسابات المتوفرة

source: Account Number
ar: رقم الحساب

source: Wallet Address
ar: عنوان الحفظة

source: Owner
ar: المالك

source: Click to copy details
ar: اضفط للنسخ

source: No available accounts at the moment.
ar: لا توجد حسابات متوفرة حاليا

source: Upload Screenshot
ar: رفع لقطة شاشة

source: Submit Proof
ar: تأكيد
